{"text": "Throne of Eldraine: The Wildered Quest is an e-book written by Kate Elliott , published by Wizards of the Coast and Penguin Random House on September 4, 2019. It is available in English for $3.99 everywhere Penguin Random House publishes e-books, including Amazon, Barnes & Noble, and the Apple Store. This will be the only way to go deeper than the cards and read the full Throne of Eldraine story. The Wildered Quest follows Rowan Kenrith , who is featured on the cover of the book. The story is “about going on a quest and getting lost — maybe not physically lost so much as in other ways” and is the start of a larger story arc. The young warrior-mage twins Rowan and Will Kenrith quest for their missing father, the High King. Rowan and Will's powers are strong, but the world of Eldraine is a dangerous place! A thrilling mashup of Arthurian legend and Grimm's fairy tales seen through the unique lens of Magic: The Gathering, here you will find magic, monsters, and mystery true to both traditions. Chapter 1. The fey planeswalker Oko has just arrived on Eldraine when he is attacked and wounded by Garruk Wildspeaker . Escaping in the form of a stag , he turns the tables on Garruk and traps the hunter in a net of thorn-laced vines. Oko notices Liliana 's corrupting magic coursing through Garruk's veins and the hedron lying buried in his skin. When Garruk reveals that he is also a planeswalker and that he can chase Oko to any plane he travels to, Oko mesmerizes him and turns him into a subservient bodyguard named \"Dog\". Chapter 2. High King Algenus Kenrith is about to leave on the Grand Procession, his first-harvests tour of all five courts of the Realm. His twin children Rowan and Will are too young to quest but are allowed by their parents to go along as humble attendants on the baggage train. From her excitement, impatient Rowan is almost unable to contain her electric powers, but Will is bored. When Will is entranced by a vision of foreign worlds, created by his ice magic, they miss the departure of the cavalcade. They have to stay behind. After being berated by their stern but kind stepmother, they decide to sneak off and join the procession anyway. Chapter 3. While their stepmother is distracted by state business, the twins escape the castle. To shorten the route to their father, they have to cross a narrow strip of the Wilds on the Choking Drum Ridge. However, the magic forest seems to be larger than they thought and they are attacked by fierce redcaps . They defeat the first batch, but they hear a larger group coming near and also hear something big moving through the woods. Chapter 4. Rowan and Will clear the forest, but discover that they are still in the enchanted Wilds. They find themselves standing on a promontory above a cliff face that shouldn't have been there. When they are about to be overwhelmed by the redcaps, they are unexpectedly rescued by Oko and Garruk. Afterward, the naive Rowan is ready to fall for the charms of the fey, though Will is not so trusting. When the twins show their distrust of the savage Garruk, Oko orders his Dog to not harm them. Pretending to be from Eldraine, but meanwhile quizzing Rowan about the plane, Oko and Garruk join the twins on their way to Beckborough. Chapter 5. Will walks with Garruk and unsuccessfully tries to engage him in a conversation. He suspects something is wrong with the big man. The companions reach Beckborough in time to see the Procession arrive, with the High King in the lead and his trusted knight companion Cado at his side. The twins leave Oko and Garruk and find their friends Titus and Cerise who had discovered their absence but had covered for them. Meanwhile, Oko is up to no good. He disguises himself as Cado and deletes the memory of their encounter in the twin's minds. A bit later, he manages to abduct their father, the High King. Chapter 6. It is three months later and the eve of the twin's eighteenth birthday. The High King is still missing, and the courts and courtiers don't give Queen Linden the respect she deserves. Will and his younger sister Hazel find a blue faerie within the walls of Ardenvale, meaning that the Wilds are infringing on the court. Rowan and Will decide to start on a quest to find their father, and Titus and Cerise join them. Queen Linden unexpectedly gives them her blessing and sends Cado along as a companion and protector. Chapter 7. The company leaves Ardenvale and travels to Vantress . On their way there, they kill an ogre and meet the Vantress loremage Elowen . Elowen notices that the twins have been hexed in the past, although they have no idea what she is talking about. At Vantress, Will presents the magic mirror Indrelon with his vision . In exchange, the mirror shows the twins a clearing in the Wilds . At the center of the wide-open space rises a mound on which stands a pair of ivory obelisks carved with sigils. At the base of the mound stands a magnificent stag . “Find the stag and you will find your father,” says Indrelon. Chapter 8. Together with Elowen, the party travels to Garenbrig to make use of the Great Henge and portal. They are stopped by three Garenbrig bear knights who mistrust strangers. The knights are on edge because of the growing incursions from the Wilds, as well as by the visit to their kingdom of the flying Castle Locthwain and its sinister elven queen. Chapter 9. The party arrives at Garenbrig and meets the benevolent giant, King Yorvo , and the visiting Queen Ayara . The Queen seems distracted. Elowen reveals that she has identified the time and location of Indrelon's stag image. She asks Yorvo to move the stones to tune the Great Henge and send them to that exact location at dawn the next morning. Yorvo remarks that Midwinter's Day would not be an auspicious time to enter the Wilds. Chapter 10. The party travels through the portal of the Great Henge to the heartland of the Wilds. The rash Titus is first attacked by a drake and then killed by a lich-lord . A magnificent stag appears and helps the rest of the party to defeat the lich-lord. As a hunting party is heard approaching, the stag flees over an obsidian bridge into the old crown city of the lost elven dominion. Although warned not to use the obsidian bridge, the party has no choice but to follow. Chapter 11. Within the enchanted ruins of the elven city of the heartland, Will and Rowan immediately lose track of the rest of their company. Then they encounter a feature that Will had seen in his vision : a massive dragon's skull as tall as a house that sits on the path, facing them with its bony jaws gaping wide open. They have found the amphitheater mentioned by Elowen earlier, carved out of the body of a petrified dragon. Rowan sneaks inside and witnesses an encounter between the Council of Druids of the wild elves and Queen Ayara. Although it is revealed that Ayara still partakes in the Wild Hunt , she is arguing for peace between the Wilds and the Realm. However, some of the druids follow the lead of a mysterious stranger and want to go to war with the Realm. Not much further down the road, the twins encounter the stranger himself, and suddenly realize that they have met him earlier. It is Oko! He explains that he sees it as his mission to help the denizens of the Wilds to embrace their freedom, and to cast off the yoke of the Realm. When Cado and Elowen join them in the glade, they see through Oko's charming manners and immediately distrust him. So Oko changes Elowen into a crested eagle, which flies away, and traps the remaining company in a faerie ring of thorns and nettles. Meanwhile, Garruk has caught Cerise and the stag. As Oko takes his leave with the stag, Rowan finally realizes that the stag is her father and that Oko is bringing it to the midwinter hunt to start a war. Chapter 12. Trapped in the thorn dome together, Will tries to befriend Garruk. The animals of the party seem to trust the big hunter. Touching on hidden sentiments while talking about fathers, they find mutual trust. Convinced that the hedron in Garruk's neck is the source of his bewitchment, Will persuades Cerise to remove it. While this has the desired effect of Garruk regaining his memories and his own will, it also returns the Chain Veil 's curse to its full force. Garruk corrupts Hale, Cado's griffin , and then kills it out of pity. The thorn enclosure withers and Garruk leaves to take his revenge on Oko. Chapter 13. The party splits up. The bereaved Cado and the wounded Cerise travel back through the portal, before it closes at dusk, to warn Queen Linden. Rowan and Will go after their father. They witness the commencement of the Wild Hunt . Chapter 14. Garruk is overwhelmed by his curse and is attacked in a river by dark undines and by a four-armed, tentacled, howl-back. As Garruk is drowning, Will tries to save the huge man despite the poor odds and at great risk to his own life. Will's act of persistence summons the Cauldron of Eternity . When Garruk's body is placed into the Cauldron, the curse dissipates and his life is returned. Chapter 15. Garruk and the twins find the Wild Hunt and the royal stag at a witch's haunted glade and an abandoned cottage on the fringe of the Wilds. From a well, a bucket rises into view, filled with a human skull punctured through one eye socket by a sword. The twins try to prevent the killing of the stag but are outnumbered. They unexpectedly receive aid when Elowen, returned in human form, and Queen Linden arrives with a host of Ardenvale griffin knights. A brawl ensues, which ends with a person looking like Queen Ayara shooting the stag with an arrow and mortally wounding it. Chapter 16. The murderer is revealed to be Oko in disguise. Garruk manages to capture him, but Rowan prevents Garruk from killing the fey to bring Oko to justice. In the confusion, Oko manages to planeswalk away. The elves claim their prey and each tastes the blood of the dying stag. Thus the ritual of the Wild Hunt is completed and the elves leave. Obedient to their queen's command, the Ardenvale knights also fly away, with a clamor of wings. Linden, Elowen, the twins, and Garruk remain with the stag. As it dies, it transforms back into the form of Algenus Kenrith. Queen Linden then reveals that the cottage, where the stag had led the Wild Hunt, was the home of the twin's birth mother. The witch had fed Algenus a love potion that had stolen his memory and his heart. When Linden finally found Algenus a year later, the twins had been born and then killed by their mother. The witch had desired their innocent blood to brew an elixir that would give her a longer life. Linden had returned Algenus to his senses with a true love's kiss and had given the life in her sword to revive the twins. Algenus had killed the witch and had thrown her down the well with his sword still embedded in her. He went out of his mind with shame and rage, had taken Linden's sword, and rode away into the Wilds to try to regain his honor by performing heroic deeds. Linden gave up her quest and had taken the twins home. As there is still life in Algenus' sword from the well, Linden uses it to return him to the world of the living. Rowen's traumatic experiences in the Wilds and the revelations about her origins shock her thoroughly. Her Planeswalker's spark ignites . As it turns out that she shares that spark with Will, they both disappear in a shower of light and ice. Chapter 17. After the High King and Queen realize that their children are gone, Garruk pledges to find them and protect them."}